AkagiYui/esp32s3-iot-sdk/sdkconfig.defaults
# 本项目的构建配置真源。sdkconfig 是构建产物，不纳入版本控制。
# 修改后需要删除 build/ 或执行 `idf.py fullclean` 再构建。

CONFIG_IDF_TARGET="esp32s3"

# ---- Flash ----
# 板载 16MB Flash。保持 DIO：S3 模组上 QIO 的收益有限，而个别 flash 颗粒在
# 80MHz QIO 下并不稳定，出问题只能重新烧录。
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- 分区表 ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- PSRAM ----
# ESP32-S3-WROOM-1-N16R8：8MB Octal PSRAM。不开启的话这 8MB 完全是浪费。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# 大块分配优先走 PSRAM，把内部 RAM 留给 WiFi/LWIP 这类必须放内部的用途。
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# ---- OTA ----
# 开启回滚：新固件启动后必须显式确认，否则下次重启自动退回旧版本。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# ---- Coredump ----
# 分区表里划了 coredump 分区，不开这项等于白留 64KB。
# ELF 格式与 SHA256 校验由 ESP_COREDUMP_ENABLE 自动选上，不需要也不能单独配置。
# CAPTURE_DRAM 保持关闭：打开后需要至少 128KB 的分区，而任务栈与寄存器现场
# 已经足够定位绝大多数崩溃。
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_CAPTURE_DRAM=n
CONFIG_ESP_COREDUMP_CHECK_BOOT=y

# ---- 编译 ----
# 固件按体积优化，给 OTA 双分区留出余量。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y

# ---- 日志 ----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# ---- FreeRTOS ----
# uxTaskGetSystemState() 需要它，用来采集所有任务的栈水位并通过接口暴露。
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# ---- 看门狗 ----
# 10 秒：OTA 写 flash 与 WiFi 扫描都可能让某个任务长时间不让出。
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT=y

# ---- HTTP 服务 ----
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# ---- LittleFS ----
CONFIG_LITTLEFS_MAX_PARTITIONS=3
CONFIG_LITTLEFS_USE_MTIME=y
CONFIG_LITTLEFS_MTIME_USE_SECONDS=y

# ---- 网络 ----
CONFIG_LWIP_LOCAL_HOSTNAME="kenko32"
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_DHCPS=y

# ---- 时间 ----
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
